Revit 2026 API

# FloorSpanDirectionAngle Property

---

Retrieve the span direction angle of the floor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SpanDirectionAngle { get; set; }
```
```vb
Public Property SpanDirectionAngle As Double
	Get
	Set
```
```cpp
public:
property double SpanDirectionAngle {
	double get ();
	void set (double value);
}
```
```fsharp
member SpanDirectionAngle : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: |

The angle returned is in radians. An exception will be thrown if the floor is non structural.

#### Reference

Floor Class

Autodesk.Revit.DB Namespace